tutorials/ablFlow_Scalability/constant/airfoils/airfoil_40
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoil_40
{
    type lookup;
    data
    (
    //   alpha   C_d    C_l
        (-180    0.0185  0    )
        (-175    0.0332  0.394)
        (-170    0.0945  0.788)
        (-160    0.2809  0.67 )
        (-155    0.3932  0.749)
        (-150    0.5112  0.797)
        (-145    0.6309  0.818)
        (-140    0.7485  0.813)
        (-135    0.8612  0.786)
        (-130    0.9665  0.739)
        (-125    1.0625  0.675)
        (-120    1.1476  0.596)
        (-115    1.2206  0.505)
        (-110    1.2805  0.403)
        (-105    1.3265  0.294)
        (-100    1.3582  0.179)
        (-95     1.3752  0.06 )
        (-90     1.3774 -0.06 )
        (-85     1.3648 -0.179)
        (-80     1.3376 -0.295)
        (-75     1.2962 -0.407)
        (-70     1.2409 -0.512)
        (-65     1.1725 -0.608)
        (-60     1.0919 -0.693)
        (-55     1.0002 -0.764)
        (-50     0.899  -0.82 )
        (-45     0.79   -0.857)
        (-40     0.6754 -0.875)
        (-35     0.5579 -0.869)
        (-30     0.4405 -0.838)
        (-25     0.3256 -0.791)
        (-24     0.3013 -0.794)
        (-23     0.2762 -0.805)
        (-22     0.2506 -0.821)
        (-21     0.2246 -0.843)
        (-20     0.1983 -0.869)
        (-19     0.172  -0.899)
        (-18     0.1457 -0.931)
        (-17     0.1197 -0.964)
        (-16     0.094  -0.999)
        (-15     0.0689 -1.033)
        (-14.5   0.0567 -1.05 )
        (-12.01  0.0271 -0.953)
        (-11     0.0303 -0.9  )
        (-9.98   0.0287 -0.827)
        (-8.12   0.0124 -0.536)
        (-7.62   0.0109 -0.467)
        (-7.11   0.0092 -0.393)
        (-6.6    0.0083 -0.323)
        (-6.5    0.0089 -0.311)
        (-6      0.0082 -0.245)
        (-5.5    0.0074 -0.178)
        (-5      0.0069 -0.113)
        (-4.5    0.0065 -0.048)
        (-4      0.0063  0.016)
        (-3.5    0.0061  0.08 )
        (-3      0.0058  0.145)
        (-2.5    0.0057  0.208)
        (-2      0.0057  0.27 )
        (-1.5    0.0057  0.333)
        (-1      0.0057  0.396)
        (-0.5    0.0057  0.458)
        ( 0      0.0057  0.521)
        ( 0.5    0.0057  0.583)
        ( 1      0.0058  0.645)
        ( 1.5    0.0058  0.706)
        ( 2      0.0059  0.768)
        ( 2.5    0.0061  0.828)
        ( 3      0.0063  0.888)
        ( 3.5    0.0066  0.948)
        ( 4      0.0071  0.996)
        ( 4.5    0.0079  1.046)
        ( 5      0.009   1.095)
        ( 5.5    0.0103  1.145)
        ( 6      0.0113  1.192)
        ( 6.5    0.0122  1.239)
        ( 7      0.0131  1.283)
        ( 7.5    0.0139  1.324)
        ( 8      0.0147  1.358)
        ( 8.5    0.0158  1.385)
        ( 9      0.0181  1.403)
        ( 9.5    0.0211  1.401)
        ( 10     0.0255  1.358)
        ( 10.5   0.0301  1.313)
        ( 11     0.0347  1.287)
        ( 11.5   0.0401  1.274)
        ( 12     0.0468  1.272)
        ( 12.5   0.0545  1.273)
        ( 13     0.0633  1.273)
        ( 13.5   0.0722  1.273)
        ( 14     0.0806  1.272)
        ( 14.5   0.09    1.273)
        ( 15     0.0987  1.275)
        ( 15.5   0.1075  1.281)
        ( 16     0.117   1.284)
        ( 16.5   0.127   1.296)
        ( 17     0.1368  1.306)
        ( 17.5   0.1464  1.308)
        ( 18     0.1562  1.308)
        ( 18.5   0.1664  1.308)
        ( 19     0.177   1.308)
        ( 19.5   0.1878  1.307)
        ( 20     0.1987  1.311)
        ( 20.5   0.21    1.325)
        ( 21     0.2214  1.324)
        ( 22     0.2499  1.277)
        ( 23     0.2786  1.229)
        ( 24     0.3077  1.182)
        ( 25     0.3371  1.136)
        ( 26     0.3664  1.093)
        ( 28     0.4246  1.017)
        ( 30     0.4813  0.962)
        ( 32     0.5356  0.937)
        ( 35     0.6127  0.947)
        ( 40     0.7396  0.95 )
        ( 45     0.8623  0.928)
        ( 50     0.9781  0.884)
        ( 55     1.0846  0.821)
        ( 60     1.1796  0.74 )
        ( 65     1.2617  0.646)
        ( 70     1.3297  0.54 )
        ( 75     1.3827  0.425)
        ( 80     1.4202  0.304)
        ( 85     1.4423  0.179)
        ( 90     1.4512  0.053)
        ( 95     1.448  -0.073)
        ( 100    1.4294 -0.198)
        ( 105    1.3954 -0.319)
        ( 110    1.3464 -0.434)
        ( 115    1.2829 -0.541)
        ( 120    1.2057 -0.637)
        ( 125    1.1157 -0.72 )
        ( 130    1.0144 -0.787)
        ( 135    0.9033 -0.836)
        ( 140    0.7845 -0.864)
        ( 145    0.6605 -0.869)
        ( 150    0.5346 -0.847)
        ( 155    0.4103 -0.795)
        ( 160    0.2922 -0.711)
        ( 170    0.0969 -0.788)
        ( 175    0.0334 -0.394)
        ( 180    0.0185  0    )
    );
}
