tutorials/ablFlow_Scalability/constant/airfoils/airfoil_53
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoil_53
{
    type lookup;
    data
    (
    //   alpha   C_d    C_l
        (-180.00   0.0198    0.000)
        (-175.00   0.0341    0.374)
        (-170.00   0.0955    0.749)
        (-160.00   0.2807    0.659)
        (-155.00   0.3919    0.736)
        (-150.00   0.5086    0.783)
        (-145.00   0.6267    0.803)
        (-140.00   0.7427    0.798)
        (-135.00   0.8537    0.771)
        (-130.00   0.9574    0.724)
        (-125.00   1.0519    0.660)
        (-120.00   1.1355    0.581)
        (-115.00   1.2070    0.491)
        (-110.00   1.2656    0.390)
        (-105.00   1.3104    0.282)
        (-100.00   1.3410    0.169)
        ( -95.00   1.3572    0.052)
        ( -90.00   1.3587   -0.067)
        ( -85.00   1.3456   -0.184)
        ( -80.00   1.3181   -0.299)
        ( -75.00   1.2765   -0.409)
        ( -70.00   1.2212   -0.512)
        ( -65.00   1.1532   -0.606)
        ( -60.00   1.0731   -0.689)
        ( -55.00   0.9822   -0.759)
        ( -50.00   0.8820   -0.814)
        ( -45.00   0.7742   -0.850)
        ( -40.00   0.6610   -0.866)
        ( -35.00   0.5451   -0.860)
        ( -30.00   0.4295   -0.829)
        ( -25.00   0.3071   -0.853)
        ( -24.00   0.2814   -0.870)
        ( -23.00   0.2556   -0.890)
        ( -22.00   0.2297   -0.911)
        ( -21.00   0.2040   -0.934)
        ( -20.00   0.1785   -0.958)
        ( -19.00   0.1534   -0.982)
        ( -18.00   0.1288   -1.005)
        ( -17.00   0.1037   -1.082)
        ( -16.00   0.0786   -1.113)
        ( -15.00   0.0535   -1.105)
        ( -14.00   0.0283   -1.078)
        ( -13.50   0.0158   -1.053)
        ( -13.00   0.0151   -1.015)
        ( -12.00   0.0134   -0.904)
        ( -11.00   0.0121   -0.807)
        ( -10.00   0.0111   -0.711)
        (  -9.00   0.0099   -0.595)
        (  -8.00   0.0091   -0.478)
        (  -7.00   0.0086   -0.375)
        (  -6.00   0.0082   -0.264)
        (  -5.00   0.0079   -0.151)
        (  -4.00   0.0072   -0.017)
        (  -3.00   0.0064    0.088)
        (  -2.00   0.0054    0.213)
        (  -1.00   0.0052    0.328)
        (   0.00   0.0052    0.442)
        (   1.00   0.0052    0.556)
        (   2.00   0.0053    0.670)
        (   3.00   0.0053    0.784)
        (   4.00   0.0054    0.898)
        (   5.00   0.0058    1.011)
        (   6.00   0.0091    1.103)
        (   7.00   0.0113    1.181)
        (   8.00   0.0124    1.257)
        (   8.50   0.0130    1.293)
        (   9.00   0.0136    1.326)
        (   9.50   0.0143    1.356)
        (  10.00   0.0150    1.382)
        (  10.50   0.0267    1.400)
        (  11.00   0.0383    1.415)
        (  11.50   0.0498    1.425)
        (  12.00   0.0613    1.434)
        (  12.50   0.0727    1.443)
        (  13.00   0.0841    1.451)
        (  13.50   0.0954    1.453)
        (  14.00   0.1065    1.448)
        (  14.50   0.1176    1.444)
        (  15.00   0.1287    1.445)
        (  15.50   0.1398    1.447)
        (  16.00   0.1509    1.448)
        (  16.50   0.1619    1.444)
        (  17.00   0.1728    1.438)
        (  17.50   0.1837    1.439)
        (  18.00   0.1947    1.448)
        (  18.50   0.2057    1.452)
        (  19.00   0.2165    1.448)
        (  19.50   0.2272    1.438)
        (  20.00   0.2379    1.428)
        (  21.00   0.2590    1.401)
        (  22.00   0.2799    1.359)
        (  23.00   0.3004    1.300)
        (  24.00   0.3204    1.220)
        (  25.00   0.3377    1.168)
        (  26.00   0.3554    1.116)
        (  28.00   0.3916    1.015)
        (  30.00   0.4294    0.926)
        (  32.00   0.4690    0.855)
        (  35.00   0.5324    0.800)
        (  40.00   0.6452    0.804)
        (  45.00   0.7573    0.793)
        (  50.00   0.8664    0.763)
        (  55.00   0.9708    0.717)
        (  60.00   1.0693    0.656)
        (  65.00   1.1606    0.582)
        (  70.00   1.2438    0.495)
        (  75.00   1.3178    0.398)
        (  80.00   1.3809    0.291)
        (  85.00   1.4304    0.176)
        (  90.00   1.4565    0.053)
        (  95.00   1.4533   -0.074)
        ( 100.00   1.4345   -0.199)
        ( 105.00   1.4004   -0.321)
        ( 110.00   1.3512   -0.436)
        ( 115.00   1.2874   -0.543)
        ( 120.00   1.2099   -0.640)
        ( 125.00   1.1196   -0.723)
        ( 130.00   1.0179   -0.790)
        ( 135.00   0.9064   -0.840)
        ( 140.00   0.7871   -0.868)
        ( 145.00   0.6627   -0.872)
        ( 150.00   0.5363   -0.850)
        ( 155.00   0.4116   -0.798)
        ( 160.00   0.2931   -0.714)
        ( 170.00   0.0971   -0.749)
        ( 175.00   0.0334   -0.374)
        ( 180.00   0.0198    0.000)
    );
}
