tutorials/ablFlow_Scalability/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions" 

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $flowVelocity;
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions"
        value           $internalField;
    }

    ground
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    
    top
    {
        type            uniformFixedValue;
        #include        "include/ABLConditions"
        uniformValue    ($UTop 0 0);

    }

    #include "include/sideAndTopPatches"

}


// ************************************************************************* //
